cask_args appdir: '/Applications'

tap "caarlos0/tap"
tap "chef/chef"
tap "getantibody/tap"
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "nektos/tap"
tap "neovim/neovim"
tap "brightdigit/homebrew-speculid"
tap "valelint/vale"
tap "vapor/tap"

cask "java"

# CLI tool for working with Architecture Decision Records
# brew "adr-tools"
# Record and share terminal sessions
brew "asciinema"
# Use AWS IAM credentials to authenticate to Kubernetes
brew "aws-iam-authenticator"
# Official Amazon AWS command-line interface
brew "awscli"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Decentralized dependency manager for Cocoa
brew "carthage"
# Statistics utility to count lines of code
brew "cloc"
# Cross-platform make
brew "cmake"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Shell extension that allows the un/loading of environment vars depending on the current directory
brew "direnv"
# Go dependency management tool
brew "dep"
# Good-lookin' diffs with diff-highlight and more
brew "diff-so-fancy"
# Functional metaprogramming aware language built on Erlang VM
brew "elixir"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Collection of GNU find, xargs, and locate
brew "findutils"
# Foreman in Go for Procfile-based application management
brew "forego"
# Cleans up old and inactive forks on your GitHub account
brew "fork-cleaner"
# Command-line fuzzy finder written in Go
brew "fzf"
# GNU awk utility
brew "gawk"
# GNU debugger
brew "gdb"
# GNU internationalization (i18n) and localization (l10n) library
brew "gettext", link: true
# GIF image/animation creator/editor
brew "gifsicle"
# Distributed revision control system
brew "git"
# Small git utilities
brew "git-extras"
# AVH edition of git-flow
brew "git-flow-avh"
# Git extension for versioning large files
brew "git-lfs"
# Easy TOC creation for GitHub README.md (in go)
brew "github-markdown-toc"
# Command-line option parsing utility
brew "gnu-getopt"
# C code prettifier
brew "gnu-indent"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# GNU version of the tar archiving utility
brew "gnu-tar"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Deliver Go binaries as fast and easily as possible
brew "goreleaser"
# Open-source build automation tool based on the Groovy and Kotlin DSL
brew "gradle"
# Bash and Zsh completion for Gradle
brew "gradle-completion"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# Colorize logfiles and command output
brew "grc"
# Like cURL, but for gRPC
brew "grpcurl"
# The Kubernetes package manager
brew "helm"
# The Kubernetes package manager
brew "helm@2"
# Curl statistics made simple
brew "httpstat"
# Add GitHub support to git on the command-line
brew "hub"
# GitFlow for GitHub
# brew "hubflow"
# Configurable static site generator
brew "hugo"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Calculate various network masks, etc. from a given IP address
brew "ipcalc"
# malloc implementation emphasizing fragmentation avoidance
# brew "jemalloc"
# Manage your Java environment
brew "jenv"
# Command-line interface for Jfrog Artifactory and Bintray
brew "jfrog-cli-go"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Domain specific configuration language for defining JSON data
brew "jsonnet"
# # Little helper to run Rancher Lab's k3s in Docker
# brew "k3d"
# # Tool that can switch between kubectl contexts easily and create aliases
# brew "kubectx"
# YAML Parser
brew "libyaml"
# Java-based project management
brew "maven"
# Collection of tools that nobody wrote when UNIX was young
brew "moreutils"
# Library for a binary-based efficient data interchange format
# brew "msgpack"
# 'traceroute' and 'ping' in a single tool
brew "mtr"
# NCurses Disk Usage
# brew "ncdu"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Port scanning utility for large networks
brew "nmap"
# Manage multiple Node.js versions
brew "nvm"
# OpenBSD freely-licensed SSH connectivity tools
brew "openssh"
# 7-Zip (high compression file archiver) implementation
brew "p7zip"
# Tool for creating identical machine images for multiple platforms
brew "packer"
# Pinentry for GPG on Mac
brew "pinentry-mac"
# Service monitoring system and time series database
# brew "prometheus"
# Show ps output as a tree
brew "pstree"
# Python version management
brew "pyenv"
# Ruby version manager
brew "rbenv"
# Library for command-line editing
brew "readline"
# Install various Ruby versions and implementations
brew "ruby-build"
# Persistent key-value database, with built-in net interface
brew "redis"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# The Rust toolchain installer
brew "rustup-init"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# Diff images from the command-line
brew "spaceman-diff"
# Sparklines for the shell
brew "spark"
# Add a public key to a remote machine's authorized_keys file
brew "ssh-copy-id"
# Tail multiple Kubernetes pods & their containers
# brew "stern"
# User interface to the TELNET protocol (built from macOS Sierra sources)
# brew "telnet"
# Tool to build, change, and version infrastructure
brew "terraform"
# Thin wrapper for Terraform e.g. for locking state
brew "terragrunt"
# Simplified and community-driven man pages
brew "tldr"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Extract, view, and test RAR archives
brew "unrar"
# HTTP load testing tool and library
brew "vegeta"
# Vi 'workalike' with many additional features
brew "vim"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Watch files and take action when they change
brew "watchman"
# Show the current WiFi network password
brew "wifi-password"
# Internet file retriever
brew "wget"
# JavaScript package manager
brew "yarn"
# Download YouTube videos from the command-line
brew "youtube-dl"
# Generate your Xcode project from a spec file and your folder structure
brew "xcodegen"
# UNIX shell (command interpreter)
brew "zsh"
# Clone all repos of a github organization
brew "caarlos0/tap/clone-org"
# quickly ssh into gcloud instances
brew "caarlos0/tap/gssh"
# Like gofmt, but for JSON files
brew "caarlos0/tap/jsonfmt"
# Compares the amount of issues and pull requests you created with the amount of comments and code reviews you did.
brew "caarlos0/tap/karmahub"
# Get the contributor stats summary from all repos of any given organization
brew "caarlos0/tap/org-stats"
# The fastest shell plugin manager
brew "getantibody/tap/antibody"
# Everything you need to get started with Heroku
brew "heroku/brew/heroku"
# A customizable, syntax-aware linter for prose.
brew "valelint/vale/vale"

cask "1password"
cask "airflow"
cask "alfred"
cask "android-studio"
cask "appcleaner"
cask "banktivity"
cask "brave-browser"
cask "charles"
# cask "chefdk"
cask "cleanmymac"
cask "craftmanager"
cask "dash"
# cask "deckset"
cask "discord"
cask "docker"
cask "dropbox"
# cask "evernote"
cask "figma"
# cask "filezilla"
cask "firefox"
# cask "font-hack"
# cask "font-source-code-pro"
# cask "goland"
cask "google-chrome"
cask "google-cloud-sdk"
cask "gpg-suite"
cask "hammerspoon"
cask "hex-fiend"
cask "iconjar"
cask "intel-haxm"
cask "intel-power-gadget"
cask "intellij-idea-ce"
cask "imageoptim"
cask "istat-menus"
cask "iterm2"
cask "kap"
cask "keepingyouawake"
cask "keka"
cask "keybase"
cask "kindle"
# cask "lastpass"
cask "little-snitch"
cask "micro-snitch"
cask "monodraw"
cask "ngrok"
# cask "nordvpn"
cask "notion"
cask "now"
cask "paste"
cask "paw"
cask "postgres"
cask "postico"
cask "private-internet-access"
cask "qlcolorcode"
cask "qlimagesize"
cask "qlmarkdown"
cask "qlprettypatch"
cask "qlstephen"
cask "quicklook-csv"
cask "quicklook-json"
cask "rescuetime"
cask "reveal"
cask "serial"
cask "sherlock"
cask "sip"
cask "sketchup"
cask "skyfonts"
cask "skype"
# cask "slack"
cask "sourcetree"
cask "spectacle"
cask "brightdigit/speculid/speculid"
cask "spotify"
cask "sqlpro-for-sqlite"
cask "subtitles"
cask "suspicious-package"
cask "telegram"
cask 'teensy'
cask 'textexpander'
cask "transmission"
cask "vagrant"
cask "vanilla"
cask 'virtualbox'
# cask "viscosity"
cask 'visual-studio'
cask "visual-studio-code"
cask "vlc"
cask 'vmware-fusion'
cask "webpquicklook"
cask "whatsapp"
cask 'wireshark'
cask 'wwdc'
cask 'xquartz'
cask 'zeplin'
cask 'zoomus'
